[{"answers": ["A", "B", "C", "D"], "options": {"A": "You can use IAM Policies", "B": "You can use Bucket policies", "C": "You can use Access Control Lists (ACLs)", "D": "You can use the Server Side Encryption (SSE)", "E": "You can serve it through Cloudfront"}, "text": "How do you secure company critical data on S3 (chose 4 correct answers)"}, {"answers": ["A"], "options": {"A": "EBS automatically encrypts data on it for more security", "B": "You can use your own encryption layer on the top", "C": "Use S3 instead", "D": "Block the EC2 to access data to your EBS"}, "text": "How to secure data on rest in EBS?"}, {"answers": ["A"], "options": {"A": "Use Cloudfront to serve images", "B": "Restrict access to those websites in the bucket policy", "C": "Use glacier to store images", "D": "Restrict access to those websites in the IAM policy", "E": "Remove the public URL link from the object in S3"}, "text": "You have a photo selling website where you have a library of photos on S3. You noticed that there are some websites that are showing the link to your S3 photos. How do you restrict sites like these using your S3 photos link?"}, {"answers": ["C", "D"], "options": {"A": "Designing a business application which requires a lot of co-ordination between different tasks", "B": "Video encoding application where each video is encoded with a pre-defined number of steps", "C": "Receiving thousands of notifications from a process and add them to a queue", "D": "Process a queue of messages where each message is a task that needs to be completed"}, "text": "In which of the following cases should you use SQS - Simple Queue Service (chose 2 correct answers)"}, {"answers": ["B"], "options": {"A": "Every S3 account has a predefined bucket where the logs are stored", "B": "When processing a request to store data, the service will redundantly store your object across multiple facilities before returning SUCCESS.", "C": "You can see the HTTP success code in the logs", "D": "Using a combination of Content-MD5 checksums"}, "text": "How do you ensure that the data has been saved properly in S3?"}, {"answers": ["D"], "options": {"A": "VPC", "B": "Public Subnet", "C": "Private Subnet", "D": "Placement Group", "E": "Availability Zone"}, "text": "You are running an application on an EC2 and now you want to add another EC2 for your application that requires a high bandwidth connect with the existing EC2. Where should you launch your EC2 in this case?"}, {"answers": ["A", "B"], "options": {"A": "Designing a business application which requires a lot of co-ordination between different tasks", "B": "Video encoding application where each video is encoded with a pre-defined number of steps", "C": "Receiving thousands of notifications from a process and add them to a queue", "D": "Process a queue of messages where each message is a task that needs to be completed"}, "text": "Where should you use SWF - Simple Workflow Service (chose 2 correct answers)"}, {"answers": ["B", "D"], "options": {"A": "SNS", "B": "Cloudwatch", "C": "SQS", "D": "ELB"}, "text": "What services are required for Auto Scaling (chose 2 correct answers)"}, {"answers": ["A", "B", "D", "E"], "options": {"A": "Automatic geo-redundant replication", "B": "It provides a simple web interface to create and store data sets, query and return data", "C": "You can store you relational database in Simple DB", "D": "Data is automatically indexed", "E": "You don't need to worry about the infrastructure required"}, "text": "What are the characteristics of Simple DB (chose 4 correct answers)"}, {"answers": ["B", "C"], "options": {"A": "Active database storage.", "B": "Infrequently accessed data.", "C": "Data archives.", "D": "Frequently accessed data.", "E": "Cached session data."}, "text": "Amazon Glacier is designed for (chose 2 correct answers)"}, {"answers": ["A"], "options": {"A": "Attach an Elastic IP to the instance", "B": "Nothing. The instance is accessible from the Internet", "C": "Launch a NAT instance and route all traffic to it", "D": "Make an entry in the route table passing all traffic going outside the VPC to the NAT instance"}, "text": "An instance is launched into the public subnet of a VPC. Which of the following must be done in order for it to be accessible FROM the Internet?"}, {"answers": ["B"], "options": {"A": "The public subnet", "B": "The private subnet", "C": "Either of them", "D": "Not recommended, they should ideally be launched outside VPC"}, "text": "In VPCs with private and public subnets, database servers should ideally be launched into:"}, {"answers": ["A", "B"], "options": {"A": "It reduces the load on your web servers", "B": "It reduces the load on your database", "C": "Gives you more availability of cached data when your Multi-AZ RDS is under maintenance", "D": "Gives you faster access to your cache data"}, "text": "What are the benefits of using Elasticache for your web application (chose 2 correct answers)"}, {"answers": ["C"], "options": {"A": "The instance is replaced automatically by the ELB.", "B": "The instance gets terminated automatically by the ELB.", "C": "The ELB stops sending traffic to the instance that failed its health check.", "D": "The instance gets quarantined by the ELB for root cause analysis."}, "text": "You configured ELB to perform health checks on EC2 instances. If an instance fails to pass health checks, which statement will be true?"}, {"answers": ["B", "C", "D"], "options": {"A": "It is used for SQL databases like MsSQL, MySQL, Oracle", "B": "Gives you a fast and predictable performance with seamless scalability", "C": "It is a managed service provided by AWS", "D": "When reading data from Amazon DynamoDB, users can specify whether they want the read to be eventually consistent or strongly consistent", "E": "There is a limit of stored data or throughput of data"}, "text": "What are the characteristics of Dynamo DB (chose 3 correct answers)"}, {"answers": ["A", "B", "D"], "options": {"A": "2 EC2 in 3 regions with ELB on top", "B": "3 EC2 in 2 AZ with ELB on top", "C": "Auto Scaling rule for 6 instances always running", "D": "Auto scaling rule for 3 instance always running in each zone", "E": "Auto Scaling Replace the lost capacity in case of zone failure in the other zone", "F": "Auto Scaling Replace the lost capacity in case of region failure in other region"}, "text": "You have a business critical application that requires it to be highly available with 6 instances always running. What should you do to achieve this (chose 3 correct answers)"}, {"answers": ["B", "D"], "options": {"A": "You can use it to replace an instance in the ELB when it fails its health check", "B": "Helps you quickly deploy and manage applications in the AWS cloud", "C": "It creates a template for your EC2 instance", "D": "You don't need to worry about the infrastructure required to run your applications"}, "text": "What are the characteristics of Elastic Beanstalk (chose 2 correct answers)"}, {"answers": ["C"], "options": {"A": "It is configurable in the IAM policies for the user", "B": "By Using Multi-factor authentication", "C": "By Using active directory and LDAP integration", "D": "By Configuring SAML 2.0", "E": "It is currently not possible in AWS"}, "text": "How do you achieve single sign on with AWS"}, {"answers": ["B", "C", "E"], "options": {"A": "You can have one EC2 in more than 1 VPC", "B": "There will always be atleast 1 default VPC", "C": "A VPC is always across multiple availability zones within a region", "D": "You can either have a VPC with public subnet or private subnet", "E": "You may use a third party software VPN to create a site to site or remote access VPN connection with your VPC via the Internet Gateway"}, "text": "What is true about VPC (chose 3 correct answers)"}, {"answers": ["A"], "options": {"A": "Create an Origin Access Identity (OAI) for CloudFront and grant access to the objects in your S3 bucket to that OAI.", "B": "Add the CloudFront account security group \"Amazon-cf/Amazon-cf-sg\" to the appropriate S3 bucket policy.", "C": "Create an Identity and Access Management (IAM) User for CloudFront and grant access to the objects in your S3 bucket to that IAM User.", "D": "Create a S3 bucket policy that lists the CloudFront distribution ID as the Principal and the target bucket as the Amazon Resource Name (ARN)."}, "text": "You are building a system to distribute confidential training videos to employees. Using CloudFront, what method could be used to serve content that is stored in S3, but not publically accessible from S3 directly?"}, {"answers": ["B"], "options": {"A": "The instance follows the rules of the older subnet", "B": "The instance follows the rules of both the subnets", "C": "The instance follows the rules of the newer subnet", "D": "Not possible cannot be connected to 2 ENIs"}, "text": "An instance is connected to an ENI (Elastic Network Interface) in one subnet. What happens when you attach an ENI of a different subnet to this instance?"}, {"answers": ["D"], "options": {"A": "A Record", "B": "CName record", "C": "AAAA record", "D": "Alias", "E": "NS Record"}, "text": "How do you point apex record of your website (example.com) to the public DNS of the Elastic Load Balancer?"}, {"answers": ["B", "E"], "options": {"A": "The Elastic IP will be dissociated from the instance", "B": "All data on instance-store devices will be lost", "C": "All data on EBS (Elastic Block Store) devices will be lost", "D": "The ENI (Elastic Network Interface) is detached", "E": "The underlying host for the instance may change"}, "text": "Which of the following will occur when an EC2 instance in a VPC (Virtual Private Cloud) with an associated Elastic IP is stopped and started (chose 2 correct answers)"}, {"answers": ["B"], "options": {"A": "On-Demand", "B": "Reserved", "C": "Dedicated", "D": "Spot", "E": "EC2 is not the right choice here"}, "text": "You are running an ERP application on EC2 for your company that runs 24x7 and the load is predictable and constant throughout the year. Which is the most cost-efficient option for the EC2 purchase model in this case?"}, {"answers": ["C", "D", "E"], "options": {"A": "You can attach one EBS volume to multiple EC2 instance", "B": "Data in EBS is stored across multiple AZ for redundancy", "C": "Maximum size of an EBS can be 1 TB", "D": "You can have provisioned IOPS with your EBS volumes", "E": "EBS behaves like raw unformatted block device"}, "text": "What are the characteristics of EBS (chose 3 correct answers)"}, {"answers": ["D"], "options": {"A": "Make sure that the patches are up to date on the instance", "B": "Make sure the port 22 are open on the subnet for incoming traffic", "C": "Make sure the port 22 are open on the subnet for outgoing traffic", "D": "Make sure the port 22 are open on the security group for incoming traffic", "E": "Make sure the port 22 are open on the security group for outgoing traffic"}, "text": "You notice that you are not able to access your EC2 linux instance using SSH. What should you check first?"}, {"answers": ["A", "B", "C", "D"], "options": {"A": "You can share your AMI with other AWS account owners", "B": "You can create an instance store-backed AMI", "C": "You can create an EBS-backed AMI", "D": "For Instance stored-backed AMIs, the root volume is stored in S3", "E": "For EBS stored-backed AMIs, the root volume is stored in S3"}, "text": "What is true about AMI (chose 4 correct answers)"}, {"answers": ["E", "C", "A"], "options": {"A": "You can create multiple read replica for ready heavy applications", "B": "You can have a read replica of a read replica", "C": "Daily backups are automatically taken", "D": "You can enable Multi-AZ option to have automatic failover in a different region", "E": "You can have provisioned IOPS for your RDS database"}, "text": "What is true about RDS (chose 3 correct answers)"}, {"answers": ["B", "C"], "options": {"A": "By Default all the services are enabled for a new IAM user", "B": "By Default all the services are disabled for a new IAM user", "C": "You can create multiple access ID and secret keys for 1 IAM user", "D": "Option 4", "E": "Option 5"}, "text": "What are the characteristics of IAM (chose 2 correct answers)"}, {"answers": ["A", "D"], "options": {"A": "network traffic entering and exiting each subnet can be allowed or denied via network Access Control Lists (ACLs)", "B": "A subnet can be across multiple availability zones", "C": "A subnet can be across multiple regions", "D": "Default subnets are assigned a /20 netblocks", "E": "Default subnets are assigned a /16 netblocks"}, "text": "What are the characteristics of Subnet (chose 2 correct answers)"}, {"answers": ["B"], "options": {"A": "1/7th of the time", "B": "3/10th of the time", "C": "3/7th of the time", "D": "1/4th of the time"}, "text": "You have created 4 weighted resource record sets with weights 1, 2, 3 and 4. The 3rd record set is selected by Route53?"}, {"answers": ["A", "B", "D"], "options": {"A": "A webserver running on EC2", "B": "A webserver running in your own datacenter", "C": "A RDS instance", "D": "An Amazon S3 bucket", "E": "A Glacier storage"}, "text": "Which of the following can be used as an origin server in CloudFront?(Choose 3)"}, {"answers": ["B"], "options": {"A": "Option 1 An Error 404 not found is returned", "B": "CloudFront delivers the content directly from the origin server and stores it in the cache of the edge location", "C": "The request is kept on hold till content is delivered to the edge location", "D": "The request is routed to the next closest edge location"}, "text": "In cloudFront what happens when content is NOT present at an Edge location and a request is made to it?"}, {"answers": ["A", "B", "D"], "options": {"A": "Signed URLs can be created to access objects from CloudFront edge locations", "B": "Direct access to S3 URLs can be removed therefore allowing access only through CloudFront URLs", "C": "Mark the S3 bucket private and allow access to CloudFront by means of Roles", "D": "Mark the S3 bucket private and and create an Origin Access Identity to access the objects"}, "text": "Which of the following is true with respect to serving private content through CloudFront? (chose 3 correct answers)"}, {"answers": ["C"], "options": {"A": "Resources", "B": "Parameters", "C": "Outputs", "D": "Mappings"}, "text": "You have written a CloudFormation template that creates 1 elastic load balancer fronting 2 EC2 instances. Which section of the template should you edit so that the DNS of the load balancer is returned upon creation of the stack?"}, {"answers": ["D"], "options": {"A": "On-Demand", "B": "Reserved", "C": "Dedicated", "D": "Spot", "E": "EC2 is not the right choice here"}, "text": "You are doing a large data analysis which requires high computing power and many instances to be launched simultaneously and then to be retired after the analysis. If the instance is retired during the analysis, the program automatically shifts the analysis to the other instance. Which is the most cost-efficient option for launching the EC2 in this case?"}, {"answers": ["C", "D"], "options": {"A": "You can do the penetration on your individual EC2 instance only", "B": "A prior permission is required from AWS for penetration testing", "C": "You cannot do the penetration testing at all", "D": "You can ask AWS support to do the penetration testing", "E": "AWS will automatically conduct penetration testing from time to time"}, "text": "What is true about penetration testing in AWS (chose 2 correct answers)"}, {"answers": ["B", "C"], "options": {"A": "You get a read-replica", "B": "More availability during the maintenance window", "C": "Automatic failover in case of one data center failure", "D": "More IOPS available for data throughput", "E": "You get more privileges to manage your database"}, "text": "What are the benefits of Multi-AZ RDS deployments (chose 2 correct answers)"}, {"answers": ["C", "D", "E"], "options": {"A": "Images and videos", "B": "Static files for your websites", "C": "Your website database", "D": "Notifications from a computer program", "E": "Static Files that are accessed once in many years"}, "text": "What kind of data should not be stored in S3 (chose 3 correct answers)"}, {"answers": ["C", "B", "D"], "options": {"A": "It can be applied across regions", "B": "It saves you significant money over on-demand instance", "C": "You can shut down the reserved instance any time you want and the hourly charge wont incur for the shutdown hours", "D": "If your AMI changes the Reserved instance is still valid if it's the same instance type", "E": "You pay a fixed amount of money irrespective of the number of hours you used the instance for"}, "text": "What are the characteristics of a reserved instance (chose 3 correct answers)"}, {"answers": ["C", "D"], "options": {"A": "You can use it to replace an instance in the ELB when it fails its health check", "B": "Helps you quickly deploy and manage applications in the AWS cloud", "C": "It creates a template for your EC2 instance", "D": "You don't need to worry about the infrastructure required to run your applications"}, "text": "What are the characteristics of CloudFormation (chose 2 correct answers)"}, {"answers": ["D"], "options": {"A": "Disable S3 delete using an IAM bucket policy", "B": "Access S3 data only using signed URLs", "C": "Enable S3 reduced redundancy storage", "D": "Enable S3 versioning on the bucket", "E": "Enable MFA protected access"}, "text": "To protect S3 data from accidental deletion and overwriting you should:"}, {"answers": ["B"], "options": {"A": "AES 256 bit encryption of data stored on any shared storage device", "B": "Decommissioning of storage device using industry-standard practices", "C": "Background virus scans of EBS volumes and EBS snapshots", "D": "Replication of data across multiple geographic regions", "E": "Secure wiping of EBS volumes when they are un-mounted"}, "text": "Which is an operational process performed by AWS for data security?"}, {"answers": ["A", "C"], "options": {"A": "Hypervisor visible metrics such as CPU utilization", "B": "Operating system visible metrics such as memory utilization", "C": "Network Utilization (Read-write)", "D": "Web server visible metrics such as number failed transaction requests", "E": "Database visible metrics such as number of connections"}, "text": "In the basic monitoring package for EC2, Amazon CloudWatch provides the following metrics (chose 2 correct answers)"}, {"answers": ["C"], "options": {"A": "Launch it in a VPC", "B": "Launch it under an ELB", "C": "Pre-assign an IP using Cloudformation script", "D": "Launch it in a placement group"}, "text": "How should you launch instance if you need a pre-defined IP?"}, {"answers": ["A", "D"], "options": {"A": "EC2", "B": "RDS", "C": "Dynamo DB", "D": "EMR (Elastic Map Reduce)", "E": "Simple DB"}, "text": "In Which case do you have full authority of the underlying instance (chose 2 correct answers)"}, {"answers": ["A", "C", "D"], "options": {"A": "The snapshots are stored in S3", "B": "The snapshots are just stored as another EBS volume", "C": "Snapshots are incremental in nature and only", "D": "You can share the snapshot with other AWS accounts", "E": "Snapshots are automatically encrypted"}, "text": "What is true about EBS (chose 3 correct answers)"}, {"answers": ["B", "C", "D"], "options": {"A": "Security group restricts access to a Subnet while ACL restricts traffic to EC2", "B": "Security group restricts access to EC2 while ACL restricts traffic to a subnet", "C": "Security group can work outside the VPC also while ACL only works within a VPC", "D": "Network ACL performs stateless filtering and Security group provides stateful filtering", "E": "Security group can only set Allow rule, while ACL can set Deny rule also", "F": "Option 5"}, "text": "What is the difference between a security group in VPC and a network ACL in VPC (chose 3 correct answers)"}, {"answers": ["C"], "options": {"A": "Simply attach an elastic IP", "B": "If there is also a public subnet in the same VPC, an ENI can be attached to the instance with the IP address range of the public subnet", "C": "If there is a public subnet in the same VPC with a NAT instance attached to internet gateway, then a route can be configured from the instance to the NAT", "D": "There is no way for an instance in private subnet to talk to the internet"}, "text": "For an EC2 instance launched in a private subnet in VPC, which of the following are the options for it to be able to connect to the internet (assume security groups have proper ports open)"}, {"answers": ["B", "C", "D"], "options": {"A": "For EBS backed AMI, the EBS volume with operation system on it is preserved", "B": "For EBS backed AMI, any volume attached other than the OS volume is preserved", "C": "All the snapshots of the EBS volume with operating system is preserved", "D": "For S3 backed AMI, all the data in the local (ephemeral) hard drive is deleted", "E": "For Instance store-backed EC2 the data is lost when the instance is rebooted"}, "text": "What happens to data when an EC2 instance terminates (chose 3 correct answers)"}, {"answers": ["C", "D", "E"], "options": {"A": "Start up EC2 instances when CPU utilization is above threshold", "B": "Release EC2 instances when CPU utilization is below threshold", "C": "Increase the instance size when utilization is above threshold", "D": "Add more Relational Database Service (RDS) read replicas when utilization is above threshold", "E": "Reboots an instance if the health check is failed for that instance"}, "text": "Which of the following Auto scaling cannot do (chose 3 correct answers)"}, {"answers": ["A", "B", "C"], "options": {"A": "Bucket namespace is shared and is global among all AWS users.", "B": "Bucket names can contain alpha numeric characters", "C": "Bucket are associated with a region, and all data in a bucket resides in that region", "D": "Buckets can be transferred from one account to another through API", "E": "You can have unlimited number of buckets in each AWS account"}, "text": "What is true for S3 buckets (chose 3 correct answers)"}, {"answers": ["A"], "options": {"A": "Yes, not for all regions", "B": "Yes, for all regions", "C": "No, it does not provide read-after-write consistency", "D": "You can provision this by making the right API calls"}, "text": "Does S3 provides read-after-write consistency?"}, {"answers": ["A", "D", "E"], "options": {"A": "You can have unlimited number of objects in S3 bucket", "B": "An S3 object can be of unlimited size", "C": "Data stored in S3 is encrypted", "D": "You can use Reduced Redundancy storage for lower cost option", "E": "You can serve your static website from S3"}, "text": "Choose the correct statement (chose 3 correct answers)"}, {"answers": ["B"], "options": {"A": "An Error 404 not found is returned", "B": "CloudFront delivers the content directly from the origin server and stores it in the cache of the edge location", "C": "The request is kept on hold till content is delivered to the edge location", "D": "The request is routed to the next closest edge location"}, "text": "In CloudFront what happens when content is NOT present at an Edge location and a request is made to it?"}, {"answers": ["C", "B"], "options": {"A": "EC2", "B": "ELB", "C": "RDS", "D": "Dynamo DB", "E": "EBS"}, "text": "Which of the services could spread across Multi-AZ (chose 2 correct answers)"}, {"answers": ["A", "C", "E"], "options": {"A": "Using AWS management console", "B": "Using AWS API tools", "C": "Using AWS command line interface", "D": "By doing an RDP to the instance", "E": "By doing an SSH to the instance"}, "text": "How do you mount a new EBS to an EC2 (chose 3 correct answers)"}, {"answers": ["E"], "options": {"A": "Instance based SSD storage", "B": "EBS with SSD storage", "C": "EBS with provisioned IOPS", "D": "Stripe data across Multiple EBS volumes with Raid 5", "E": "Stripe data across Multiple EBS volumes with Raid 0"}, "text": "Which of the following will provide the maximum IOPS for your EC2?"}, {"answers": ["B", "E"], "options": {"A": "The instance based storage is automatically saved in S3", "B": "You can use the instance based storage for your root volume", "C": "You can attach multiple Elastic IPs to a single EC2", "D": "The public DNS of the EC2 remains intact when you shut down the EC2 and start it again", "E": "Data on the instance based storage remains intact when you reboot the instance"}, "text": "Chose the right statements about EC2 instance(chose 2 correct answers)"}, {"answers": ["C"], "options": {"A": "Stop the EC2, issue a snapshot command, Switch on the EC2", "B": "Stop the EC2, issue a snapshot command, wait to complete the snapshot, remount EBS", "C": "Just issue the snapshot command", "D": "Un-mount EBS, issue snapshot command, remount", "E": "Un-mount EBS, Take snapshot, wait to complete the snapshot, remount EBS"}, "text": "What is the best way of taking a fast snapshot without losing the consistency?"}, {"answers": ["B"], "options": {"A": "There is no such limit", "B": "5 TB", "C": "5 GB", "D": "100 GB"}, "text": "What is the maximum size of a single S3 object?"}, {"answers": ["A", "D"], "options": {"A": "MultiAZ deployed database can tolerate an Availability Zone failure", "B": "Decrease latencies if app servers accessing database are in multiple Availability zones", "C": "Make database access times faster for all app servers", "D": "Make database more available during maintenance tasks"}, "text": "Which of the following benefits does adding Multi-AZ deployment in RDS provide (choose multiple if more than one is true)?"}, {"answers": ["C"], "options": {"A": "Resolve the ELB name to an IP address and point the website to that IP address", "B": "There is no direct way to do so, Route53 has to be used", "C": "Generate a CNAME record for the website pointing to the DNS name of the ELB"}, "text": "When an ELB is setup, what is the best way to route a website's traffic to it?"}, {"answers": ["D"], "options": {"A": "A.", "B": "AAAA", "C": "NS", "D": "CNAME"}, "text": "You want to use Route53 to direct your www sub-domain to an elastic load balancer fronting your web servers. What kind of record set should you create?"}, {"answers": ["A"], "options": {"A": "Singapore", "B": "Oregon", "C": "Depends on the load on each machine", "D": "Both, because 2 requests are made, 1 to each machine"}, "text": "You have created a Route 53 latency record set from your domain to a machine in Singapore and a similar record to a machine in Oregon. When a user located in India visits your domain he will be routed to:"}, {"answers": ["A"], "options": {"A": "Elastic IP Address", "B": "Class B IP Address", "C": "Class A IP Address", "D": "Dynamic IP Address"}, "text": "If I want an instance to have a public IP address, which IP address should I use?"}, {"answers": ["D"], "options": {"A": "Redundancy Removal System", "B": "Relational Rights Storage", "C": "Regional Rights Standard", "D": "Reduced Redundancy Storage"}, "text": "What does RRS stand for when talking about S3?"}, {"answers": ["A"], "options": {"A": "It allows to integrate on-premises IT environments with Cloud Storage.", "B": "A direct encrypted connection to Amazon S3.", "C": "It's a backup solution that provides an on-premises Cloud storage.", "D": "It provides an encrypted SSL endpoint for backups in the Cloud."}, "text": "What does the AWS Storage Gateway provide?"}, {"answers": ["A"], "options": {"A": "Six: Amazon Aurora, Oracle, Microsoft SQL Server, PostgreSQL, MySQL and MariaDB", "B": "Just two: MySQL and Oracle.", "C": "Five: MySQL, PostgreSQL, MongoDB, Cassandra and SQLite.", "D": "Just one: MySQL."}, "text": "How many relational database engines does RDS currently support?"}, {"answers": ["D"], "options": {"A": "Resource-based and Product-based", "B": "Product-based and Service-based", "C": "Service-based", "D": "User-based and Resource-based"}, "text": "What are the two permission types used by AWS?"}, {"answers": ["d"], "options": {"A": "Disk usage activity of the ephemeral volumes of an Amazon EC2 instance", "B": "CPU Utilisation of an Amazon Elastic compute cloud(EC2) instance", "C": "Disk usage activity of an elastic block store volume attached to an Amazon EC2 instance", "D": "Disk full percentage of an Elastic Block store volume"}, "text": "Which of the following requires a custom CloudWatch metric to monitoring?"}, {"answers": ["A"], "options": {"A": "Latency reported by the elastic load balancer(ELB)", "B": "Request count reported by ELB", "C": "Aggregate networking for the web tier", "D": "Aggregate CPU Utilisation for the web tier"}, "text": "Your web application is using Auto Scaling and Elastic load balancing. You want to monitor the application to ensure that it maintains a good quality of service for your customers, defined by the application's page load time.  What metric in Amazon CloudWatch can best be used for this?"}, {"answers": ["E", "B", "D"], "options": {"A": "Create an RDS read-replica and redirect half of the database read request to it", "B": "Cache database queries in Amazon elastic cloud", "C": "Setup RDS in multi-availability zone mode.", "D": "Shard the database and distribute loads between shards.", "E": "Use Amazon cloudfront to cache database queries."}, "text": "You run a two-tiered application with the following components: an elastic load balancer (ELB), three web/application servers on EC2, and one MySQL RDS database.  With growing loads, the database queries take longer and longer and slow down the overall response time for user requests.  What of the following options could speed up performance? (choose 3)"}, {"answers": ["C"], "options": {"A": "launch two to six additional instances outside of the autoscaling group to handle the additional load.", "B": "populate the custom CloudWatch metric for concurrent session and initiate scaling action based on that metric instead of CPU use.", "C": "Empirically determine the expected CPU use for 200 concurrent sessions and adjust the CloudWatch alarm threshold to be that CPU use.", "D": "Add a script to each instance to detect the number of concurrent sessions.if the no. of session remains over 200 for five minutes, have the instance increased the desired capacity of the autoscaling group by one."}, "text": "As an application has increased in popularity, reports of performance issues have grown. the current configuration initiates scaling actions based on avg CPU utilization; however during reports of slowness, CloudWatch graphs have shown that avg CPU remains steady at 40 percent. this is well below the alarm threshold of 60 percent.Your developers have discovered that, due to the unique design of the application,performance degradation occurs on an instance when it is processing more than 200 threads. What is the best way to ensure that your application scales to match the demands?"}, {"answers": ["A"], "options": {"A": "Federated Identity based on AWS security token service (STS) using an AWS IAM policy for the respective S3 bucket", "B": "IAM user per registered client with an IAM policy granted AWS S3 access to the respective bucket", "C": "AWS S3 policy with a ..."}, "text": "Your company built a mobile application that has already been downloaded several thousand times. Which authentication solution would enable mobile clients to access pictures stored on an AWS S3 bucket and provide you with the highest flexibility to rotate credentials?"}, {"answers": ["A"], "options": {"A": "No, all EBS volume is stored in a single Availability Zone", "B": "Yes, EBS volume has multiple copies so it should be fine", "C": "Depends on how it is setup", "D": "Depends on the Region where EBS volume is initiated"}, "text": "EBS can always tolerate an Availability Zone failure?"}, {"answers": ["A"], "options": {"A": "$0.00", "B": "$0.02", "C": "$0.03", "D": "$0.04", "E": "$0.05"}, "text": "You receive a spot instance at a bit of $0.05/hr. After 30 minutes, the spot price increase to $0.06/hr and your spot instances is terminated by AWS. what was the total EC2 compute cost of running your spot instance."}, {"answers": ["D"], "options": {"A": "Immediately to the new instances only", "B": "Immediately to the new instances only, but old instance must be stopped and restarted before before the new rule apply.", "C": "To all instances, but it may take several minutes for old install to see the changes.", "D": "Immediately to all instances in the security group"}, "text": "You have an Amazon Elastic Cloud Compute (EC2) security group with several running EC2 instances. You change the security group rules to allow inbound traffic on a new port and protocol, and launch several new instance in the same security group.  The new rule apply:-"}, {"answers": ["A", "B", "E"], "options": {"A": "Amazon DynamoDB", "B": "Amazon ElastiCache", "C": "Elastic Load Balancing", "D": "AWS storage Gateway", "E": "Amazon Relational Database service[RDS]", "F": "Amazon CloudWatch"}, "text": "You are developing a highly available web application using stateless web servers. Which services are suitable for storing session state data (choose 3)."}, {"answers": ["A", "E"], "options": {"A": "Enable S3 versioning on bucket", "B": "Access S3 data using only signed URL.", "C": "Disable S3 delete using an IAM bucket policy.", "D": "Enable S3 Reduced Redundancy storage", "E": "Enable multi-factor authentication(MFA) protected access."}, "text": "What combination of the following options will protect Amazon Simple Storage Services (S3) objects from both accidental deletion and accidental overwriting? (Choose two)"}, {"answers": ["D"], "options": {"A": "2", "B": "3", "C": "4", "D": "6"}, "text": "You have been tasked with creating a VPC network topology for your company. The VPC network must support both internet-facing application and internally-facing application accessed only over VPN. Both internet-facing and internally-facing application must be able to leverage at least three AZs for high availability. At a minimum, how many subnets must you create within your VPC to accommodate these requirement."}, {"answers": ["D"], "options": {"A": "Deploy a NAT instance into the public subnet.", "B": "Modify the routing table for the public subnet.", "C": "Configure a publically routable IP address in the host OS of the fourth instance.", "D": "Assign an Elastic IP address to the fourth instance."}, "text": "You have an Amazon Virtual Private Cloud with a public subnet. Three EC2 instances currently running inside the subnet can successfully communicate with other hosts on the internet. You launch a fourth instance in the same subnet, using the same Amazon machine image (AMI) and security group configuration, you used for others, but find that this instance cannot be accessed from the internet. What should you do to enable internet access?"}, {"answers": ["D"], "options": {"A": "Deploy in three availability zone, with auto scaling minimum set to handel 33 percent peak load per zone.", "B": "Deploy in two region using Weighted Round Robin(WRR), with Auto Scaling minimums set for 50 percent peak load per Region.", "C": "Deploy in two region using Weighted Round Robin(WRR), with Auto Scaling minimums set for 100 percent peak load per region.", "D": "Deploy in three availability Zones, with auto scaling minimum set to handle 50 percent peak load per zone."}, "text": "You have a business-critical two-tier web app currently deployed in two availability zones in a single region, using elastic, load balancing and autoscaling. The app depends on synchronous replication(very low latency connectivity) at the data layer. The application need to remain fully available even if one application availability zone goes off-line, and auto scaling cannot launch new instances in the remaining availability zones, How can the current architecture be enhanced to ensure this?"}, {"answers": ["A"], "options": {"A": "Memory use", "B": "CPU use", "C": "Disk read operations", "D": "Network in", "E": "Estimated charges"}, "text": "which of the following requires a custom CloudWatch metric to monitor?"}, {"answers": ["C"], "options": {"A": "Query the appropriate AWS CloudWatch metric", "B": "Use an ipconfig or ifconfig command", "C": "query the local instance metadata", "D": "query the local instance userdata"}, "text": "How can software determine the public and private IP addresses of the AWS EC2 instance that it is running on?"}, {"answers": ["A", "D"], "options": {"A": "Infrequently accessed data", "B": "Cached session data", "C": "Active database storage", "D": "Data archive", "E": "Frequently accessed data"}, "text": "Amazon Glacier is designed for (choose 2)"}, {"answers": ["D"], "options": {"A": "Established a dedicated network connection using AWS direct connect.", "B": "Modify the main route table to allow traffic to a network address translation instance.", "C": "Use a dedicated network address translation instance in the public subnet", "D": "Assign a static internet-routable IP address to Amazon VPC customer gateway"}, "text": "what action is required to establish an Amazon VPC VPN connection between an on-premises data center and Amazon VPC virtual private gateway?"}, {"answers": ["D"], "options": {"A": "Amazon simple notification service", "B": "Amazon simple queue service", "C": "Amazon simple workflow service", "D": "Amazon simple storage service"}, "text": "which of the following is a durable key-value store?"}, {"answers": ["A"], "options": {"A": "Destination:0.0.0.0/0 > Target:your internet gateway", "B": "Destination:192.168.1.257/0 > Target:your internet gateway", "C": "Destination:0.0.0.0/33 > Target:your virtual private gateway", "D": "Destination:0.0.0.0/0 > Target:0.0.0.0/24", "E": "Destination:0.0.0.0/32 > Target:your virtual private gateway"}, "text": "which route must be added to your routing table in order to allow connections to the internet from your subnet?"}, {"answers": ["A"], "options": {"A": "You encountered a soft limit of 20 instances per region.submit the limit increase form and retry the failed requests once approved.", "B": "AWS allows you to provision no more than 20 instances per availability zone.select a different availability zone and retry the failed request.", "C": "You need to use Amazon VPC in order to provision more than 20 instances in a single availability zone. simply terminate the resources already provisioned and re-launch them all in a VPC.", "D": "you encountered an API throttling situation and should try the failed request using an exponential decay retry algorithm."}, "text": "After creating a new AWS account, you use the API to request 40 on-demand AWS EC2 instances in a single availability zone. After 20 successful requests, subsequent request failed. what could be a reason for this issue, and how would you resolve it?"}, {"answers": ["D", "E"], "options": {"A": "Modify the auto scaling group termination policy to terminate the oldest instance first.", "B": "Modify the auto scaling to use scheduled scaling actions", "C": "Modify the auto scaling group termination policy to terminate the newest instance first.", "D": "Modify the Amazon CloudWatch alarm period that trigger yours auto scaling scale down policy.", "E": "modify the auto scaling group cool-down timers."}, "text": "In reviewing the auto scaling events for your application you notice that your application is scaling up and down multiple times in the same hour. what design choice could you make to optimize for cost while preserving elasticity? choose 2"}, {"answers": ["B", "E"], "options": {"A": "Use three spot instances rather than three on-demand instances for the task nodes.", "B": "change the input split size in the mapreduce job configuration.", "C": "use a bootstrap action to present the S3 bucket as a local filesystem.", "D": "Launch the core nodes and task nodes within an Amazon virtual cloud.", "E": "adjust the number of simultaneous mapper tasks.", "F": "Enable termination protection for the job flow"}, "text": "A customer's nightly EMR job processes a single 2-TB data file stored on S3. The Amazon EMR job runs on two on-demand core nodes and three on-demand task nodes. which of the following may help reduce the EMR job completion time?choose 2"}, {"answers": ["D", "E"], "options": {"A": "us-west-2a with 2 EC2 instances, us-west-2b with 2 EC2 instance, us-west-2c with 2 EC2 instance", "B": "us-west-2a with 3 EC2 instances, us-west-2b with 3 EC2 instance, us-west-2c with no EC2 instance", "C": "us-west-2a with 4 EC2 instances, us-west-2b with 2 EC2 instance, us-west-2c with 2 EC2 instance", "D": "us-west-2a with 6 EC2 instances, us-west-2b with 6 EC2 instance, us-west-2c with no EC2 instance", "E": "us-west-2a with 3 EC2 instances, us-west-2b with 3 EC2 instance, us-west-2c with 3 EC2 instance"}, "text": "you have an application running in us-west-2 that requires 6 Amazon elastic compute cloud instances running at all times . with 3 availability of zones available in that region(us-west-2a,us-west-2b,us-west-2c) which of the following development provide 100% fault tolerance if any single availability zone in us-west-2 becomes unavailable?choose 2"}, {"answers": ["A"], "options": {"A": "has at least 1 route in its associate routing table that uses an internet gateway(IGW)", "B": "include a route in its associated routing table via a NAT.", "C": "has network Access control list (NACL) permitting outbound traffic to 0.0.0.0/0", "D": "has the public subnet options selected in its configuration"}, "text": "A VPC public subnet is one that:"}, {"answers": ["B"], "options": {"A": "store API credentials as an object in Amazon S3", "B": "use AWS identity and access management roles for EC2 instance", "C": "pass API credentials to the instance using instance user data", "D": "embed the API credential into your jar file"}, "text": "You are deploying a an application on EC2 that must call AWS APIs. what method of securely passing credential to the application should you use?"}, {"answers": ["B"], "options": {"A": "you must know how many customers the company has today, because this critical in understanding what their customer base will be in two years.", "B": "you must find out total number of requests per second at peak usage.", "C": "you must know the size individual objects being written to S3, in order to properly design the key namespace.", "D": "In order to build the key namespace correctly, you must understand the total amount of storage needs for each S3 bucket."}, "text": "A Startup company hired you to help them build a mobile application, that will ultimately store billions of images and videos in Amazon Simple Storage double their current installation base every six months, Due to the nature of their business, they are expecting sudden and large increase in traffic to and from S3,and need to ensure that it can handle the performance need of their applications. What other information must you gather from this customer in order to determine whether S3 is the right option."}, {"answers": ["A"], "options": {"A": "Simple Storage Solution.", "B": "Storage Storage Storage (triple redundancy Storage).", "C": "Storage Server Solution.", "D": "Simple Storage Service."}, "text": "What does Amazon S3 stand for?"}, {"answers": ["D"], "options": {"A": "3", "B": "2", "C": "4", "D": "1"}, "text": "You must assign each server to at least _____ security group"}, {"answers": ["B"], "options": {"A": "Create a copy of the EBS volume (not a snapshot)", "B": "Store a snapshot of the volume", "C": "Download the content to an EC2 instance", "D": "Back up the data in to a physical disk"}, "text": "Before I delete an EBS volume, what can I do if I want to recreate the volume later?"}, {"answers": ["B"], "options": {"A": "Possible for EBS volumes", "B": "Reserved for the root device", "C": "Recommended for EBS volumes", "D": "Recommended for instance store volumes"}, "text": "Select the most correct answer: The device name /dev/sda1 (within Amazon EC2 ) is _____"}, {"answers": ["C"], "options": {"A": "Multiple IP address", "B": "Public IP address", "C": "Private IP address", "D": "Elastic IP Address"}, "text": "All Amazon EC2 instances are assigned two IP addresses at launch. Which one can only be reached from within the Amazon EC2 network?"}, {"answers": ["A"], "options": {"A": "Less redundancy for a lower cost.", "B": "It doesn't exist in Amazon S3, but in Amazon EBS.", "C": "It allows you to destroy any copy of your files outside a specific jurisdiction.", "D": "It doesn't exist at all"}, "text": "What is the Reduced Redundancy option in Amazon S3?"}, {"answers": ["C"], "options": {"A": "Amazon Resource Number", "B": "Amazon Resource Name tag", "C": "Amazon Resource Name", "D": "Amazon Reesource Namespace"}, "text": "Fill in the blanks: Resources that are created in AWS are identified by a unique identifier called an _____."}, {"answers": ["A"], "options": {"A": "Start twenty instances as members of appserver group.", "B": "Creates 20 rules in the security group named appserver", "C": "Terminate twenty instances as members of appserver group.", "D": "Start 20 security groups"}, "text": "What does the command 'ec2-run-instances ami-e3a5408a -n 20 -g appserver' do?"}, {"answers": ["D"], "options": {"A": "secondary", "B": "backup", "C": "stand by", "D": "primary"}, "text": "When you run a DB Instance as a Multi-AZ deployment, the _____ serves database writes and reads"}, {"answers": ["A"], "options": {"A": "Virtual servers in the Cloud.", "B": "A platform to run code (Java, PHP, Python), paying on an hourly basis.", "C": "Computer Clusters in the Cloud.", "D": "Physical servers, remotely managed by the customer."}, "text": "What does Amazon EC2 provide?"}, {"answers": ["D"], "options": {"A": "Design graphical user interface interactions", "B": "Manage user identification and authorization", "C": "Store Web content", "D": "Coordinate synchronous and asynchronous tasks which are distributed and fault tolerant."}, "text": "Amazon SWF is designed to help users do what?"}, {"answers": ["C"], "options": {"A": "No", "B": "Only in VPC", "C": "Yes"}, "text": "Can I control if and when MySQL based RDS Instance is upgraded to new supported versions?"}, {"answers": ["B"], "options": {"A": "No", "B": "Yes"}, "text": "If I modify a DB Instance or the DB parameter group associated with the instance, should I reboot the instance for the changes to take effect?"}, {"answers": ["D"], "options": {"A": "Depends on the instance type", "B": "FALSE", "C": "Depends on whether you use API call", "D": "TRUE"}, "text": "When you view the block device mapping for your instance, you can see only the EBS volumes, not the instance store volumes."}, {"answers": ["A"], "options": {"A": "DeleteOnTermination", "B": "RemoveOnDeletion", "C": "RemoveOnTermination", "D": "TerminateOnDeletion"}, "text": "By default, EBS volumes that are created and attached to an instance at launch are deleted when that instance is terminated. You can modify this behavior by changing the value of the flag _____ to false when you launch the instance."}, {"answers": ["C"], "options": {"A": "Allow all inbound traffic and Allow no outbound traffic", "B": "Allow no inbound traffic and Allow no outbound traffic", "C": "Allow no inbound traffic and Allow all outbound traffic", "D": "Allow all inbound traffic and Allow all outbound traffic"}, "text": "What are the initial settings of an user created security group?"}, {"answers": ["B"], "options": {"A": "Only for Oracle RDS types", "B": "Yes", "C": "Only if configured at launch", "D": "No"}, "text": "Will my standby RDS instance be in the same Region as my primary?"}, {"answers": ["A"], "options": {"A": "TRUE", "B": "FALSE"}, "text": "When using IAM to control access to your RDS resources, the key names that can be used are case sensitive. For example, aws:CurrentTime is NOT equivalent to AWS:currenttime."}, {"answers": ["D"], "options": {"A": "running", "B": "working", "C": "progressing", "D": "pending"}, "text": "What will be the status of the snapshot until the snapshot is complete."}, {"answers": ["A"], "options": {"A": "TRUE", "B": "FALSE"}, "text": "Automated backups are enabled by default for a new DB Instance."}, {"answers": ["A"], "options": {"A": "InnoDB", "B": "MyISAM"}, "text": "Amazon RDS automated backups and DB Snapshots are currently supported for only the ______ storage engine"}, {"answers": ["D"], "options": {"A": "http://254.169.169.254/latest/", "B": "http://169.169.254.254/latest/", "C": "http://127.0.0.1/latest/", "D": "http://169.254.169.254/latest/"}, "text": "Fill in the blanks: The base URI for all requests for instance metadata is _____"}, {"answers": ["C"], "options": {"A": "ec2-deploy-snapshot", "B": "ec2-fresh-snapshot", "C": "ec2-create-snapshot", "D": "ec2-new-snapshot"}, "text": "While creating the snapshots using the the command line tools, which command should I be using?"}, {"answers": ["B"], "options": {"A": "FreeStorage", "B": "FreeStorageSpace", "C": "FreeStorageVolume", "D": "FreeDBStorageSpace"}, "text": "In Amazon CloudWatch, which metric should I be checking to ensure that your DB Instance has enough free storage space?"}, {"answers": ["A"], "options": {"A": "Amazon S3", "B": "Amazon ECS Volume", "C": "Amazon RDS", "D": "Amazon EMR"}, "text": "Amazon RDS DB snapshots and automated backups are stored in"}, {"answers": ["D"], "options": {"A": "512 Unicode characters", "B": "64 Unicode characters", "C": "256 Unicode characters", "D": "128 Unicode characters"}, "text": "What is the maximum key length of a tag?"}, {"answers": ["B"], "options": {"A": "be nested more than 3 levels", "B": "be nested at all", "C": "be nested more than 4 levels", "D": "be nested more than 2 levels"}, "text": "Security Groups can't _____."}, {"answers": ["D"], "options": {"A": "40", "B": "20", "C": "50", "D": "10"}, "text": "You must increase storage size in increments of at least _____ %"}, {"answers": ["C"], "options": {"A": "from the next billing cycle", "B": "after 30 minutes", "C": "immediately", "D": "after 24 hours"}, "text": "Changes to the backup window take effect ______."}, {"answers": ["A"], "options": {"A": "5 minutes", "B": "500 milliseconds.", "C": "30 seconds", "D": "1 minute"}, "text": "Using Amazon CloudWatch's Free Tier, what is the frequency of metric updates which you receive?"}, {"answers": ["B"], "options": {"A": "eu-west-1", "B": "us-east-1", "C": "us-east-2", "D": "ap-southeast-1"}, "text": "Which is the default region in AWS?"}, {"answers": ["B"], "options": {"A": "BYOL and Enterprise License", "B": "BYOL and License Included", "C": "Enterprise License and License Included", "D": "Role based License and License Included"}, "text": "What are the two types of licensing options available for using Amazon RDS for Oracle?"}, {"answers": ["C"], "options": {"A": "A security group in which only tasks inside can communicate with each other", "B": "A special type of worker", "C": "A collection of related Workflows", "D": "The DNS record for the Amazon SWF service"}, "text": "What does a \"Domain\" refer to in Amazon SWF?"}, {"answers": ["A"], "options": {"A": "Asynchronously", "B": "Synchronously", "C": "Weekly"}, "text": "EBS Snapshots occur _____"}, {"answers": ["A"], "options": {"A": "True", "B": "False"}, "text": "Disabling automated backups disables the point-in-time recovery feature."}, {"answers": ["C"], "options": {"A": "Raid 5", "B": "Raid 6", "C": "Raid 1", "D": "Raid 2"}, "text": "Out of the striping options available for the EBS volumes, which one has the following disadvantage : 'Doubles the amount of I/O required from the instance to EBS compared to RAID 0, because you're mirroring all writes to a pair of volumes, limiting how much you can stripe.' ?"}, {"answers": ["C"], "options": {"A": "Restart from beginning", "B": "You can resume them, if you flag the \"resume on failure\" option before uploading.", "C": "Resume on failure", "D": "Depends on the file size"}, "text": "Can Amazon S3 uploads resume on failure or do they need to restart?"}, {"answers": ["B"], "options": {"A": "Security Groups", "B": "IAM System", "C": "SSH keys", "D": "Windows passwords"}, "text": "Which of the following cannot be used in EC2 to control who has access to specific EC2 instances?"}, {"answers": ["C"], "options": {"A": "wildcards", "B": "pointers", "C": "tags", "D": "special filters"}, "text": "Fill in the blanks : _____ let you categorize your EC2 resources in different ways, for example, by purpose, owner, or environment."}, {"answers": ["A"], "options": {"A": "By using the service specific console or API\\CLI commands", "B": "None of these", "C": "Using Amazon EC2 API/CLI", "D": "Using all these methods"}, "text": "How can I change the security group membership for interfaces owned by other AWS, such as Elastic Load Balancing?"}, {"answers": ["C"], "options": {"A": "5,000 us east, 1,000 all other regions", "B": "100,000 us east, 10, 000 all other regions", "C": "Designed to scale without limits, but if you go beyond 40,000 us east/10,000 all other regions you have to contact AWS first.", "D": "There is no limit"}, "text": "What is the maximum write throughput I can provision per table for a single DynamoDB table?"}, {"answers": ["C"], "options": {"A": "Removes one or more security groups from a rule.", "B": "Removes one or more security groups from an Amazon EC2 instance.", "C": "Removes one or more rules from a security group.", "D": "Removes a security group from an account."}, "text": "What does the ec2-revoke command do with respect to the Amazon EC2 security groups?"}, {"answers": ["A"], "options": {"A": "No", "B": "Yes"}, "text": "Can a 'user' be associated with multiple AWS accounts?"}, {"answers": ["B"], "options": {"A": "TRUE", "B": "FALSE"}, "text": "True or False: Manually created DB Snapshots are deleted after the DB Instance is deleted."}, {"answers": ["A"], "options": {"A": "99.99%", "B": "99.95%", "C": "99.995%", "D": "99.999999999%"}, "text": "What is the durability of S3 RRS?"}, {"answers": ["D"], "options": {"A": "Prevents /dev/sdc from creating the instance.", "B": "Prevents /dev/sdc from deleting the instance.", "C": "Set the value of /dev/sdc to 'zero'.", "D": "Prevents /dev/sdc from attaching to the instance."}, "text": "What does specifying the mapping /dev/sdc=none do when launching an EC2 instance?"}, {"answers": ["B"], "options": {"A": "Only for Oracle RDS instances", "B": "No", "C": "Yes", "D": "Only in VPC"}, "text": "Is Federated Storage Engine currently supported by Amazon RDS for MySQL?"}, {"answers": ["C"], "options": {"A": "20", "B": "5", "C": "10", "D": "15"}, "text": "What is the maximum groups an IAM user be a member of?"}, {"answers": ["B"], "options": {"A": "FALSE", "B": "TRUE"}, "text": "True or False: When you perform a restore operation to a point in time or from a DB Snapshot, a new DB Instance is created with a new endpoint."}, {"answers": ["A"], "options": {"A": "Security Group", "B": "ACL", "C": "IAM", "D": "Private IP Addresses"}, "text": "A/An _____ acts as a firewall that controls the traffic allowed to reach one or more instances."}, {"answers": ["D"], "options": {"A": "Only for Oracle RDS types", "B": "Yes", "C": "Only if configured at launch", "D": "No"}, "text": "Will my standby RDS instance be in the same Availability Zone as my primary?"}, {"answers": ["D"], "options": {"A": "Review", "B": "DB Instance Details", "C": "Management Options", "D": "Additional Configuration"}, "text": "While launching an RDS DB instance, on which page I can select the Availability Zone?"}, {"answers": ["B"], "options": {"A": "Groups the user created security groups in to a new group for easy access.", "B": "Creates a new security group for use with your account.", "C": "Creates a new group inside the security group.", "D": "Creates a new rule inside the security group."}, "text": "What does the ec2-create-group command do with respect to the Amazon EC2 security groups?"}, {"answers": ["C"], "options": {"A": "DB Instance Details", "B": "Review", "C": "Management Options", "D": "Engine Selection"}, "text": "In the Launch Db Instance Wizard, where can I select the backup and maintenance options?"}, {"answers": ["B"], "options": {"A": "FALSE", "B": "TRUE"}, "text": "You are charged for the IOPS and storage whether or not you use them in a given month?"}, {"answers": ["D"], "options": {"A": "Read Only Access", "B": "Power User Access", "C": "AWS CloudFormation Read Only Access", "D": "Administrator Access"}, "text": "IAM provides several policy templates you can use to automatically assign permissions to the groups you create. The _____ policy template gives the Admins group permission to access all account resources, except your AWS account information."}, {"answers": ["A"], "options": {"A": "checks may still be in progress on the volume", "B": "check has passed", "C": "check has failed", "D": "there is no such status"}, "text": "While performing volume status checks using volume status checks, if the status is insufficient-data, if the status is 'insufficient-data', what does it mean?"}, {"answers": ["C"], "options": {"A": "EBSConfig Service", "B": "AMIConfig Service", "C": "Ec2Config Service", "D": "Ec2-AMIConfig Service"}, "text": "By default, when an EBS volume is attached to a Windows instance, it may show up as any drive letter on the instance. You can change the settings of the _____ Service to set the drive letters of the EBS volumes per your specifications."}, {"answers": ["A"], "options": {"A": "True", "B": "False"}, "text": "SQL Server stores logins and passwords in the master database."}, {"answers": ["B"], "options": {"A": "Yes", "B": "No", "C": "Depends on if it is in VPC or not"}, "text": "Does Amazon RDS allow direct host access via Telnet, Secure Shell (SSH), or Windows Remote Desktop Connection?"}, {"answers": ["D"], "options": {"A": "MakeSnapShot", "B": "FreshSnapshot", "C": "DeploySnapshot", "D": "CreateSnapshot"}, "text": "While creating an EC2 snapshot using the API, which Action should I be using?"}, {"answers": ["A"], "options": {"A": "I/O operations to the database are suspended for a few minutes while the backup is in progress.", "B": "I/O operations to the database are sent to a Replica (if available) for a few minutes while the backup is in progress.", "C": "I/O operations will be functioning normally", "D": "I/O operations to the database are suspended for an hour while the backup is in progress"}, "text": "What happens to the I/O operations while you take a database snapshot in a single AZ database?"}, {"answers": ["C"], "options": {"A": "OracleISAM", "B": "MSSQLDB", "C": "InnoDB", "D": "MyISAM"}, "text": "Read Replicas require a transactional storage engine and are only supported for the _____ storage engine."}, {"answers": ["D"], "options": {"A": "Yes", "B": "Only with MSSQL based RDS", "C": "Only for Oracle RDS instances", "D": "No"}, "text": "When running my DB Instance as a Multi-AZ deployment, can I use the standby for read or write operations?"}, {"answers": ["B"], "options": {"A": "If you have batch-oriented workloads", "B": "If you use production online transaction processing (OLTP) workloads.", "C": "If you have workloads that are not sensitive to consistent performance", "D": "If you infrequently read or write to the drive."}, "text": "When should I choose Provisioned IOPS over Standard RDS storage?"}, {"answers": ["B"], "options": {"A": "3", "B": "1", "C": "5", "D": "2"}, "text": "In the 'Detailed' monitoring data available for your Amazon EBS volumes, Provisioned IOPS volumes automatically send _____ minute metrics to Amazon CloudWatch."}, {"answers": ["B"], "options": {"A": "USD 0.10 per GB", "B": "No charge. It is free.", "C": "USD 0.02 per GB", "D": "USD 0.01 per GB"}, "text": "What is the minimum charge for the data transferred between Amazon RDS and Amazon EC2 Instances in the same Availability Zone?"}, {"answers": ["A"], "options": {"A": "True", "B": "False"}, "text": "Reserved Instances are available for Multi-AZ Deployments."}, {"answers": ["B"], "options": {"A": "AWS Access Control Service (ACS)", "B": "AWS Identity and Access Management (IAM)", "C": "AWS Identity Manager (AIM)", "D": "AWS Security Groups"}, "text": "Which service enables AWS customers to manage users and permissions in AWS?"}, {"answers": ["C"], "options": {"A": "None of these.", "B": "Amazon Instance Storage", "C": "Amazon EBS", "D": "All of these"}, "text": "Which Amazon Storage behaves like raw, unformatted, external block devices that you can attach to your instances?"}, {"answers": ["A"], "options": {"A": "Amazon VPC", "B": "Amazon ServiceBus", "C": "Amazon EMR", "D": "Amazon RDS"}, "text": "Which Amazon service can I use to define a virtual network that closely resembles a traditional data center?"}, {"answers": ["B"], "options": {"A": "desk.cpl", "B": "mstsc"}, "text": "What is the command line instruction for running the remote desktop client in Windows?"}, {"answers": ["B"], "options": {"A": "MyISAM", "B": "InnoDB"}, "text": "Amazon RDS automated backups and DB Snapshots are currently supported for only the ______ storage engine."}, {"answers": ["A"], "options": {"A": "3306", "B": "443", "C": "80", "D": "1158"}, "text": "MySQL installations default to port _____."}, {"answers": ["B"], "options": {"A": "DNAME", "B": "CNAME", "C": "TXT", "D": "MX"}, "text": "If you have chosen Multi-AZ deployment, in the event of an outage of your primary DB Instance, Amazon RDS automatically switches to the standby replica. The automatic failover mechanism simply changes the ______ record of the main DB Instance to point to the standby DB Instance."}, {"answers": ["A"], "options": {"A": "True", "B": "False"}, "text": "If I modify a DB Instance or the DB parameter group associated with the instance, I should reboot the instance for the changes to take effect?"}, {"answers": ["B"], "options": {"A": "Amazon Instance Storage", "B": "Amazon EBS", "C": "You can't run a database inside an Amazon instance.", "D": "Amazon S3"}, "text": "If I want to run a database in an Amazon instance, which is the most recommended Amazon storage option?"}, {"answers": ["A"], "options": {"A": "user name", "B": "password", "C": "default group"}, "text": "In regards to IAM you can edit user properties later, but you cannot use the console to change the _____."}, {"answers": ["B"], "options": {"A": "FALSE", "B": "TRUE"}, "text": "If you add a tag that has the same key as an existing tag on a DB Instance, the new value overwrites the old value."}, {"answers": ["A"], "options": {"A": "No", "B": "Yes"}, "text": "Making your snapshot public shares all snapshot data with everyone. Can the snapshots with AWS Marketplace product codes be made public?"}, {"answers": ["B"], "options": {"A": "primary public IP", "B": "secondary private IP", "C": "secondary public IP", "D": "add on secondary IP"}, "text": "Fill in the blanks: \"To ensure failover capabilities, consider using a _____ for incoming traffic on a network interface\"."}, {"answers": ["A"], "options": {"A": "The remaining Read Replicas will still replicate from the older master DB Instance", "B": "The remaining Read Replicas will be deleted", "C": "The remaining Read Replicas will be combined to one read replica"}, "text": "If I have multiple Read Replicas for my master DB Instance and I promote one of them, what happens to the rest of the Read Replicas?"}, {"answers": ["B"], "options": {"A": "No", "B": "Yes", "C": "Only in VPC", "D": "Only in certain regions"}, "text": "Can I encrypt connections between my application and my DB Instance using SSL?"}, {"answers": ["A"], "options": {"A": "Basic, Developer, Business, Enterprise", "B": "Basic, Startup, Business, Enterprise", "C": "Free, Bronze, Silver, Gold", "D": "All support is free"}, "text": "What are the four levels of AWS Premium Support?"}, {"answers": ["C"], "options": {"A": "Amazon Cloud Watch", "B": "Status of the Amazon RDS DB", "C": "AWS Service Health Dashboard", "D": "AWS Cloud Monitor"}, "text": "What can I access by visiting the URL: http://status.aws.amazon.com/ ?"}, {"answers": ["C"], "options": {"A": "Images (AMIs, kernels, RAM disks)", "B": "Amazon EBS volumes", "C": "Elastic IP addresses", "D": "VPCs"}, "text": "Please select the Amazon EC2 resource which cannot be tagged."}, {"answers": ["A"], "options": {"A": "SQL Server", "B": "MySQL", "C": "Oracle"}, "text": "Because of the extensibility limitations of striped storage attached to Windows Server, Amazon RDS does not currently support increasing storage on a _____ DB Instance."}, {"answers": ["D"], "options": {"A": "AWS Management Console", "B": "Command line interface (CLI)", "C": "IAM Query API", "D": "All of the above"}, "text": "Through which of the following interfaces is AWS Identity and Access Management available?"}, {"answers": ["C"], "options": {"A": "In Amazon EC2, private IP address is only returned to Amazon EC2 when the instance is stopped or terminated", "B": "In Amazon VPC, an instance retains its private IP address when the instance is stopped.", "C": "In Amazon VPC, an instance does NOT retain its private IP address when the instance is stopped.", "D": "In Amazon EC2, the private IP address is associated exclusively with the instance for its lifetime"}, "text": "Select the incorrect statement."}, {"answers": ["B"], "options": {"A": "Exponentially", "B": "Incrementally", "C": "EBS snapshots are not stored in the Amazon S3", "D": "Decrementally"}, "text": "How are the EBS snapshots saved on Amazon S3?"}, {"answers": ["A"], "options": {"A": "Basic", "B": "Primary", "C": "Detailed", "D": "Local"}, "text": "What is the type of monitoring data (for Amazon EBS volumes) which is available automatically in 5-minute periods at no charge called?"}, {"answers": ["A"], "options": {"A": "TRUE", "B": "FALSE"}, "text": "The new DB Instance that is created when you promote a Read Replica retains the backup window period."}, {"answers": ["B"], "options": {"A": "The topic is created, and it has the name you specified for it.", "B": "An ARN (Amazon Resource Name) is created.", "C": "You can create a topic on Amazon SQS, not on Amazon SNS.", "D": "This question doesn't make sense."}, "text": "What happens when you create a topic on Amazon SNS?"}, {"answers": ["C"], "options": {"A": "Only via API", "B": "Only via Console", "C": "Yes", "D": "No"}, "text": "Can I delete a snapshot of the root device of an EBS volume used by a registered AMI?"}, {"answers": ["B"], "options": {"A": "True", "B": "False"}, "text": "New database versions will automatically be applied to AWS RDS instances as they become available."}, {"answers": ["B"], "options": {"A": "120 seconds", "B": "1 hour", "C": "10 minutes", "D": "12 hours"}, "text": "What is the maximum response time for a Business level Premium Support case?"}, {"answers": ["C"], "options": {"A": "Amazon RDS", "B": "AWS Integrity Management", "C": "AWS Identity and Access Management", "D": "Amazon EMR"}, "text": "The _____ service is targeted at organizations with multiple users or systems that use AWS products such as Amazon EC2, Amazon SimpleDB, and the AWS Management Console."}, {"answers": ["B"], "options": {"A": "FALSE", "B": "TRUE"}, "text": "Without IAM, you cannot control the tasks a particular user or system can do and what AWS resources they might use."}, {"answers": ["B"], "options": {"A": "FALSE", "B": "TRUE"}, "text": "When you use the AWS Management Console to delete an IAM user, IAM also deletes any signing certificates and any access keys belonging to the user."}, {"answers": ["C"], "options": {"A": "FetchFailure", "B": "DescribeFailure", "C": "DescribeEvents", "D": "FetchEvents"}, "text": "When automatic failover occurs, Amazon RDS will emit a DB Instance event to inform you that automatic failover occurred. You can use the _____ to return information about events related to your DB Instance."}, {"answers": ["A"], "options": {"A": "1", "B": "5", "C": "15", "D": "10"}, "text": "What is the default maximum number of MFA devices in use per AWS account (at the root account level)?"}, {"answers": ["A"], "options": {"A": "Yes for all users except root", "B": "Yes unless special permission granted", "C": "Yes for all users", "D": "No"}, "text": "Is there a limit to how many groups a user can be in?"}, {"answers": ["B"], "options": {"A": "Only if instructed to when created", "B": "Yes", "C": "No"}, "text": "Do the Amazon EBS volumes persist independently from the running life of an Amazon EC2 instance?"}]